{
  "posts": [
    {
      "id": "1",
      "title": "Welcome to My Blog",
      "author": "Martin M.",
      "content": "This is the very first post on this blog. Stay tuned for more updates!",
      "image": "https://contents.bebee.com/users/id/0kQwz642a77afbfc6a/_avatar-OXhHp-400.png"
    },
    {
      "id": "2",
      "title": "A Country under Siege",
      "author": "Linus kaikai",
      "content": "Kenya, a nation long celebrated for its political stability in a volatile region, finds itself grappling with escalating challenges that have put its democratic institutions, economy, and security under intense strain. In the wake of rising inflation, record youth unemployment, and increasing public debt, widespread protests have erupted across major cities—including Nairobi, Kisumu, and Mombasa—fuelled by public frustration over corruption, controversial tax hikes, and economic inequality.
Simultaneously, Kenya’s border regions face persistent threats from extremist groups like Al-Shabaab, whose cross-border incursions and attacks have strained national security forces and left border communities in fear. Meanwhile, disinformation campaigns on social media, often driven by politically aligned influencers, deepen ethnic and political divides, threatening the country’s fragile unity.
Against this backdrop, government crackdowns on dissent, arbitrary arrests of activists, and violent dispersal of peaceful protests have drawn criticism from human rights groups both locally and internationally. The country's civil society is pushing back, but many fear that Kenya’s democratic gains of the past two decades are eroding under the weight of growing authoritarian tendencies.
“Country Under Siege” explores Kenya at a pivotal moment—caught between the promise of progress and the perils of instability. It is a story of resistance, resilience, and the urgent need for national dialogue and reform.",
      "image": "https://tinyurl.com/2x5fbw7j"
    },
    {
      "id": "3",
      "title": "Mastering HTML Semantics",
      "author": "CodeLady",
      "content": "HTML5 introduced semantic tags that help screen readers and SEO. Use them wisely.",
      "image": "https://picsum.photos/seed/html5/600/300"
    },
    {
      "id": "4",
      "title": "How I Built My Portfolio",
      "author": "Jane Dev",
      "content": "It took three weeks of hard work using React, Tailwind, and Netlify to showcase my work.",
      "image": "https://picsum.photos/seed/portfolio/600/300"
    },
    {
      "id": "5",
      "title": "CSS Layout Battle: Flexbox vs Grid",
      "author": "Layout Master",
      "content": "Both Flexbox and Grid are powerful. Use Flexbox for 1D and Grid for 2D layouts.",
      "image": "https://picsum.photos/seed/cssgrid/600/300"
    },
    {
      "id": "6",
      "title": "Debugging in the Browser",
      "author": "BugSquasher",
      "content": "Use console.log(), breakpoints, and browser DevTools to squash bugs quickly!",
      "image": "https://picsum.photos/seed/debug/600/300"
    },
    {
      "id": "7",
      "title": "APIs for Beginners",
      "author": "API Wizard",
      "content": "APIs let you fetch external data. Use fetch() or Axios and understand RESTful routes.",
      "image": "https://picsum.photos/seed/api/600/300"
    },
    {
      "id": "8",
      "title": "Why You Should Learn Git",
      "author": "VersionBoss",
      "content": "Git is essential for collaboration, version control, and recovering from mistakes.",
      "image": "https://picsum.photos/seed/git/600/300"
    },
    {
      "id": "9",
      "title": "Responsive Design Basics",
      "author": "MobileFirst",
      "content": "Use media queries and flexible layouts to make your site look good on all devices.",
      "image": "https://picsum.photos/seed/responsive/600/300"
    },
    {
      "id": "10",
      "title": "Deploying to GitHub Pages",
      "author": "DeployMan",
      "content": "GitHub Pages is a free, fast way to publish static sites directly from your repo.",
      "image": "https://picsum.photos/seed/githubpages/600/300"
    },
    {
      "id": "afbf",
      "title": "maandamano",
      "content": "Tutokee weno tudai gava watupee accountable leadership",
      "author": "martin Mbuba",
      "image": "https://img.freepik.com/free-photo/various-people-taking-part-protests_23-2151559886.jpg?semt=ais_items_boosted&w=740"
    },
    {
      "id": "eebe",
      "title": "Diana Kagendo mbuba",
      "content": "Manze uyu DEm anajua kucheza Golf mbaya sana.\nTrophy nazo? Pesa nazo? Luku nayo? Dinga nazo?",
      "author": "Martin mbuba",
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTF7u1pR8moa0oE_QOyTW3hedJ44wCOdULC6A&s"
    }
  ]
}